Repository: thomastibin/fabric-docs-ml
Catalog: docs/source/locale/*/LC_MESSAGES/deployment_guide_overview.po
Languages: ml

source: ``gossip``: there are a number of configuration options to think about when setting up :doc:`gossip`, including the ``externalEndpoint`` (which makes peers discoverable to peers owned by other organizations) as well as the ``bootstrap`` address (which identifies a peer in the peer's own organization).
ml: ``ഗോസിപ്പ്``: സജ്ജീകരിക്കുമ്പോൾ ചിന്തിക്കാൻ നിരവധി കോൺഫിഗറേഷൻ ഓപ്ഷനുകൾ ഉണ്ട് :doc:`gossip`, ``externalEndpoint`` (ഇത് മറ്റ് ഓർ‌ഗനൈസേഷനുകളുടെ ഉടമസ്ഥതയിലുള്ള പിയറുകൾക്കു മറ്റു പിയറുകളെ കണ്ടെത്താൻ‌ സഹായിക്കുന്നു), കൂടാതെ ``bootstrap`` വിലാസം (ഇത് പിയറിന്റെ സ്വന്തം ഓർഗനൈസേഷനിലെ ഒരു പിയറിനെ തിരിച്ചറിയുന്നു).

source: ``chaincode.externalBuilders``: this field is important to set when using :doc:`cc_service.html`.
ml: ``chaincode.externalBuilders``: ഉപയോഗിക്കുമ്പോൾ ഈ ഫീൽഡ് സജ്ജീകരിക്കേണ്ടത് പ്രധാനമാണ് :doc:`cc_service.html`.

source: When you're comfortable with how your peer has been configured, how your volumes are mounted, and your backend configuration, you can run the command to launch the peer (this command will depend on your backend configuration).
ml: നിങ്ങളുടെ പിയർ എങ്ങനെ ക്രമീകരിച്ചു, നിങ്ങളുടെ വോള്യങ്ങൾ എങ്ങനെ മൌണ്ട് ചെയ്തു, നിങ്ങളുടെ ബാക്കെൻഡ് കോൺഫിഗറേഷൻ എന്നിവയിൽ നിങ്ങൾക്ക് താൽപ്പര്യമുണ്ടെങ്കിൽ, പിയർ സമാരംഭിക്കുന്നതിന് നിങ്ങൾക്ക് കമാൻഡ് പ്രവർത്തിപ്പിക്കാൻ കഴിയും (ഈ കമാൻഡ് നിങ്ങളുടെ ബാക്കെൻഡ് കോൺഫിഗറേഷനെ ആശ്രയിച്ചിരിക്കും).

source: Create an ordering node
ml: ഒരു ഓർഡറിംഗ് നോഡ് സൃഷ്ടിക്കുക

source: Unlike the creation of a peer, you will need to create a genesis block (or reference a block that has already been created, if adding an ordering node to an existing ordering service) and specify the path to it before launching the ordering node.
ml: ഒരു പിയർ സൃഷ്ടിക്കുന്നതിൽ നിന്ന് വ്യത്യസ്തമായി, നിങ്ങൾ ഒരു ജെനിസിസ് ബ്ലോക്ക് സൃഷ്ടിക്കേണ്ടതുണ്ട് (അല്ലെങ്കിൽ നിലവിലുള്ള ഒരു ഓർ‌ഡറിംഗ് സേവനത്തിലേക്ക് ഒരു ഓർ‌ഡറിംഗ് നോഡ് ചേർ‌ക്കുകയാണെങ്കിൽ‌ ഇതിനകം സൃഷ്ടിച്ച ഒരു ബ്ലോക്കിനെ പരാമർശിക്കുക) കൂടാതെ ഓർ‌ഡറിംഗ് നോഡ് സമാരംഭിക്കുന്നതിന് മുമ്പ് അതിലേക്കുള്ള പാത വ്യക്തമാക്കുക.

source: In Fabric, this configuration file for ordering nodes is called ``orderer.yaml``. You can find a sample ``orderer.yaml`` configuration file `in the sampleconfig directory of Hyperledger Fabric <https://github.com/hyperledger/fabric/blob/master/sampleconfig/orderer.yaml>`_. Note that ``orderer.yaml`` is different than the "genesis block" of an ordering service. This block, which includes the initial configuration of the orderer system channel, must be created before an ordering node is created because it is used to bootstrap the node.
ml: ഫാബ്രിക്കിൽ, നോഡുകൾ ക്രമീകരിക്കുന്നതിനുള്ള ഈ കോൺഫിഗറേഷൻ ഫയലിനെ ``orderer.yaml`` എന്ന് വിളിക്കുന്നു. ഹൈപ്പർലെഡ്ജർ ഫാബ്രിക്കിന്റെ സാമ്പിൾ കോൺഫിഗ് ഡയറക്ടറിയിൽ നിങ്ങൾക്ക് ``orderer.yaml` കോൺഫിഗറേഷൻ ഫയൽ `കണ്ടെത്താനാകും. <https://github.com/hyperledger/fabric/blob/master/sampleconfig/orderer.yaml>`_.ഒരു ഓർ‌ഡറിംഗ് സേവനത്തിൻറെ "ജെനിസിസ് ബ്ലോക്ക് " നേക്കാൾ വ്യത്യസ്തമാണ് ``orderer.yaml`. ഓർ‌ഡെറർ സിസ്റ്റം ചാനലിന്റെ പ്രാരംഭ കോൺഫിഗറേഷൻ ഉൾപ്പെടുന്ന ഈ ബ്ലോക്ക് ഒരു ഓർ‌ഡറിംഗ് നോഡ് സൃഷ്ടിക്കുന്നതിനുമുമ്പ് സൃഷ്‌ടിക്കേണ്ടതുണ്ട്, കാരണം ഇത് നോഡ് ബൂട്ട് സ്ട്രാപ്പ് ചെയ്യുന്നതിന് ഉപയോഗിക്കുന്നു.

source: As with the peer, you will see that there are quite a number of parameters you either have the option to set or will need to set for your node to work properly. In general, if you do not have the need to change a tuning value, leave it alone.
ml: പിയറിനെപ്പോലെ, നിങ്ങൾക്ക് സജ്ജീകരിക്കാനുള്ള ഓപ്‌ഷനുള്ള നിരവധി പാരാമീറ്ററുകൾ ഉണ്ടെന്ന് നിങ്ങൾ കാണും അല്ലെങ്കിൽ നിങ്ങളുടെ നോഡ് ശരിയായി പ്രവർത്തിക്കുന്നതിന് സജ്ജമാക്കേണ്ടതുണ്ട്. പൊതുവേ, നിങ്ങൾക്ക് ഒരു ട്യൂണിംഗ് മൂല്യം മാറ്റേണ്ട ആവശ്യമില്ലെങ്കിൽ, അത് ഉപേക്ഷിക്കുക.

source: Either way, here are some values in ``orderer.yaml`` you must review. You will notice that some of these fields are the same as those in ``core.yaml`` only with different names.
ml: ഏതുവിധേനയും, നിങ്ങൾ അവലോകനം ചെയ്യേണ്ട `` orderer.yaml`` ലെ ചില മൂല്യങ്ങൾ ഇതാ. ഈ ഫീൽഡുകളിൽ ചിലത് `` core.yaml`` തുല്യമാണെന്ന് നിങ്ങൾ ശ്രദ്ധിക്കും, പേരുകളിൽ മാത്രം വ്യത്യസ്തം .

source: ``General.LocalMSPID``: this is the name of the local MSP, generated by your CA, of your orderer organization.
ml: ``General.LocalMSPID``: നിങ്ങളുടെ ഓർ‌ഡറർ‌ ഓർ‌ഗനൈസേഷന്റെ സി‌എ ജനറേറ്റുചെയ്‌ത പ്രാദേശിക എം‌എസ്‌പിയുടെ പേരാണിത്.

source: ``General.LocalMSPDir``: the place where the local MSP for the ordering node is located. Note that it is a best practice to mount this volume external to your container.
ml: ``General.LocalMSPDir``: ഓർ‌ഡറിംഗ് നോഡിനായുള്ള പ്രാദേശിക എം‌എസ്‌പി സ്ഥിതിചെയ്യുന്ന സ്ഥലം. ഈ വോളിയം നിങ്ങളുടെ കണ്ടെയ്‌നറിന് പുറത്തേക്ക് മൌണ്ട് ചെയ്യുന്നത് മികച്ച പരിശീലനമാണെന്ന് ശ്രദ്ധിക്കുക.

source: ``General.ListenAddress`` and ``General.ListenPort``: represents the endpoint to other ordering nodes in the same organization.
ml: ``General.ListenAddress``, & ``General.ListenPort``: ഒരേ ഓർഗനൈസേഷനിലെ മറ്റ് ഓർഡറിംഗ് നോഡുകളിലേക്കുള്ള എൻഡ്‌പോയിന്റിനെ പ്രതിനിധീകരിക്കുന്നു.

source: ``FileLedger``: although ordering nodes do not have a state database, they still all carry copies of the blockchain, as this allows them to verify permissions using the latest config block. Therefore the ledger fields should be customized with the correct file path.
ml: ``ഫയൽ‌ലെഡ്‌ജർ‌``: ഓർ‌ഡറിംഗ് നോഡുകൾ‌ക്ക് സ്റ്റേറ്റ് ഡാറ്റാബേസ് ഇല്ലെങ്കിലും, അവയെല്ലാം ഇപ്പോഴും ബ്ലോക്ക്‌ചെയിനിന്റെ പകർപ്പുകൾ‌ വഹിക്കുന്നു, കാരണം ഏറ്റവും പുതിയ കോൺ‌ഫിഗറേഷൻ ബ്ലോക്ക് ഉപയോഗിച്ച് അനുമതികൾ‌ പരിശോധിക്കാൻ‌ ഇത് അനുവദിക്കുന്നു. അതിനാൽ ശരിയായ ഫയൽ പാത്ത് ഉപയോഗിച്ച് ലെഡ്ജർ ഫീൽഡുകൾ ഇഷ്ടാനുസൃതമാക്കണം.

source: ``Cluster``: these values are important for ordering service nodes that communicate with other ordering nodes, such as in a Raft based ordering service.
ml: ``ക്ലസ്റ്റർ``: റാഫ്റ്റ് അടിസ്ഥാനമാക്കിയുള്ള ഓർ‌ഡറിംഗ് സേവനം പോലുള്ള മറ്റ് ഓർ‌ഡറിംഗ് നോഡുകളുമായി ആശയവിനിമയം നടത്തുന്ന സേവന നോഡുകൾ‌ ഓർ‌ഡർ‌ ചെയ്യുന്നതിന് ഈ മൂല്യങ്ങൾ‌ പ്രധാനമാണ്.

source: ``General.BootstrapFile``: this is the name of the configuration block used to bootstrap an ordering node. If this node is the first node generated in an ordering service, this file will have to be generated and is known as the "genesis block".
ml: ``ജനറൽ.ബൂട്ട്‌സ്‌ട്രാപ്പ് ഫയൽ``: ഒരു ഓർഡറിംഗ് നോഡ് ബൂട്ട് സ്ട്രാപ്പ് ചെയ്യുന്നതിന് ഉപയോഗിക്കുന്ന കോൺഫിഗറേഷൻ ബ്ലോക്കിന്റെ പേരാണിത്. ഒരു ഓർ‌ഡറിംഗ് സേവനത്തിൽ‌ ജനറേറ്റുചെയ്‌ത ആദ്യത്തെ നോഡാണ് ഈ നോഡ് എങ്കിൽ‌, ഈ ഫയൽ‌ ജനറേറ്റുചെയ്യേണ്ടിവരും, ഇതിനെ "ജെനിസിസ് ബ്ലോക്ക് " എന്ന് വിളിക്കുന്നു.

source: ``General.BootstrapMethod``: the method by which the bootstrap block is given. For now, this can only be ``file``, in which the file in the ``BootstrapFile`` is specified. Starting in 2.0, you can specify ``none`` to simply start the orderer without bootstrapping.
ml: `` ജനറൽ.ബൂട്ട്‌സ്‌ട്രാപ്പ് രീതി``: ബൂട്ട്‌സ്‌ട്രാപ്പ് ബ്ലോക്ക് നൽകുന്ന രീതി. ഇപ്പോൾ, ഇത് ``ഫയൽ`` മാത്രമായിരിക്കാൻ കഴിയും, അതിൽ `` ബൂട്ട്‌സ്‌ട്രാപ്പ് ഫയലിലെ`` ഫയൽ വ്യക്തമാക്കുന്നു. 2.0 മുതൽ‌, ബൂട്ട്‌സ്‌ട്രാപ്പിംഗ് കൂടാതെ ഓർ‌ഡെറർ‌ ആരംഭിക്കുന്നതിന് നിങ്ങൾക്ക് `` ഒന്നുമില്ല`` വ്യക്തമാക്കാൻ‌ കഴിയും.

source: ``Consensus``: determines the key/value pairs allowed by the consensus plugin (Raft ordering services are supported and recommended) for the Write Ahead Logs (``WALDir``) and Snapshots (``SnapDir``).
ml: ``സമവായം``: റൈറ്റ് അഹെഡ് ലോഗുകൾക്കും ( ``WALDir``) സ്നാപ്പ്ഷോട്ടുകൾക്കും ( ``SnapDir``) സമവായ പ്ലഗിൻ (റാഫ്റ്റ് ഓർഡറിംഗ് സേവനങ്ങൾ പിന്തുണയ്‌ക്കുകയും ശുപാർശ ചെയ്യുകയും ചെയ്യുന്നു) അനുവദിക്കുന്ന കീ / മൂല്യ ജോഡികൾ നിർണ്ണയിക്കുന്നു.

source: When you're comfortable with how your ordering node has been configured, how your volumes are mounted, and your backend configuration, you can run the command to launch the ordering node (this command will depend on your backend configuration).
ml: നിങ്ങളുടെ ഓർ‌ഡറിംഗ് നോഡ് എങ്ങനെ ക്രമീകരിച്ചു, നിങ്ങളുടെ വോള്യങ്ങൾ‌ എങ്ങനെയാണ്‌ മൌണ്ട് ചെയ്‌തിരിക്കുന്നത്, നിങ്ങളുടെ ബാക്കെൻഡ് കോൺ‌ഫിഗറേഷൻ എന്നിവയിൽ‌ നിങ്ങൾ‌ക്ക് താൽ‌പ്പര്യമുണ്ടെങ്കിൽ‌, ഓർ‌ഡറിംഗ് നോഡ് സമാരംഭിക്കുന്നതിന് നിങ്ങൾക്ക് കമാൻഡ് പ്രവർത്തിപ്പിക്കാൻ‌ കഴിയും (ഈ കമാൻഡ് നിങ്ങളുടെ ബാക്കെൻഡ് കോൺ‌ഫിഗറേഷനെ ആശ്രയിച്ചിരിക്കും).

source: Next steps
ml: അടുത്ത ഘട്ടങ്ങൾ

source: Blockchain networks are all about connection, so once you've deployed nodes, you'll obviously want to connect them to other nodes! If you have a peer organization and a peer, you'll want to join your organization to a consortium and join or :doc:`channels`. If you have an ordering node, you will want to add peer organizations to your consortium. You'll also want to learn how to develop chaincode, which you can learn about in the topics :doc:`developapps/scenario` and :doc:`chaincode_lifecycle`.
ml: ബ്ലോക്ക്‌ചെയിൻ നെറ്റ്‌വർക്കുകൾ എല്ലാം കണക്ഷനെക്കുറിച്ചാണ്, അതിനാൽ നിങ്ങൾ നോഡുകൾ വിന്യസിച്ചുകഴിഞ്ഞാൽ, നിങ്ങൾ അവയെ മറ്റ് നോഡുകളിലേക്ക് കണക്റ്റുചെയ്യാൻ ആഗ്രഹിക്കുന്നു! നിങ്ങൾക്ക് ഒരു പിയർ ഓർഗനൈസേഷനും ഒരു പിയറും ഉണ്ടെങ്കിൽ, നിങ്ങളുടെ ഓർഗനൈസേഷനിൽ ഒരു കൺസോർഷ്യത്തിലേക്ക് ചേരാൻ നിങ്ങൾ ആഗ്രഹിക്കുന്നു. ചേരുക അല്ലെങ്കിൽ :doc:`channels`. ചെയിൻ‌കോഡ് എങ്ങനെ വികസിപ്പിക്കാമെന്നും നിങ്ങൾ‌ പഠിക്കാൻ‌ താൽ‌പ്പര്യപ്പെടുന്നു, അത് :doc:`developapps/scenario` and :doc:`chaincode_lifecycle` ലെ വിഷയങ്ങളിൽ‌ നിങ്ങൾ‌ക്ക് മനസിലാക്കാൻ‌ കഴിയും.

source: Part of the process of connecting nodes and creating channels will involve modifying policies to fit the use cases of business networks. For more information about policies, check out :doc:`policies/policies`.
ml: നോഡുകൾ കണക്റ്റുചെയ്യുന്നതിനും ചാനലുകൾ സൃഷ്ടിക്കുന്നതിനുമുള്ള പ്രക്രിയയുടെ ഭാഗമായി ബിസിനസ്സ് നെറ്റ്‌വർക്കുകളുടെ ഉപയോഗ കേസുകൾക്ക് അനുയോജ്യമായ രീതിയിൽ നയങ്ങൾ പരിഷ്‌ക്കരിക്കുന്നത് ഉൾപ്പെടുന്നു. നയങ്ങളെക്കുറിച്ചുള്ള കൂടുതൽ വിവരങ്ങൾക്ക്, പരിശോധിക്കുക :doc:`policies/policies`.

source: One of the common tasks in a Fabric will be the editing of existing channels. For a tutorial about that process, check out :doc:`config_update`. One popular channel update is to add an org to an existing channel. For a tutorial about that specific process, check out :doc:`channel_update_tutorial`. For information about upgrading nodes after they have been deployed, check out :doc:`upgrading_your_components`.
ml: ഒരു ഫാബ്രിക്കിലെ പൊതുവായ ജോലികളിൽ ഒന്ന് നിലവിലുള്ള ചാനലുകളുടെ എഡിറ്റിംഗ് ആയിരിക്കും. ആ പ്രക്രിയയെക്കുറിച്ചുള്ള ഒരു ട്യൂട്ടോറിയലിനായി പരിശോധിക്കുക :doc:`config_update`. നിലവിലുള്ള ഒരു ചാനലിലേക്ക് ഒരു ഓർഗ് ചേർക്കുക എന്നതാണ് ഒരു ജനപ്രിയ ചാനൽ അപ്‌ഡേറ്റ്. ഒരു ട്യൂട്ടോറിയലിനായി ആ നിർദ്ദിഷ്ട പ്രക്രിയയെക്കുറിച്ച്, പരിശോധിക്കുക :doc:`channel_update_tutorial`. വിന്യസിച്ച ശേഷം നോഡുകൾ നവീകരിക്കുന്നതിനെക്കുറിച്ചുള്ള വിവരങ്ങൾക്ക്, പരിശോധിക്കുക :doc:`upgrading_your_components`.
