Repository: thomastibin/fabric-docs-ml
Catalog: docs/source/locale/*/LC_MESSAGES/deployment_guide_overview.po
Languages: ml

source: The other CA generates the certificates used to secure communications on Transport Layer Security (TLS). For this reason, this CA is often referred to as a "TLS CA". These TLS certificates are attached to actions as a way of preventing "man in the middle" attacks. Note that the TLS CA is only used for issuing certificates for nodes and can be shut down when that activity is completed. Users have the option to use one way (client only) TLS as well as two way (server and client) TLS, with the latter also known as "mutual TLS". Because specifying that your network will be using TLS (which is recommended) should be decided before deploying the "enrollment" CA (the YAML file specifying the configuration of this CA has a field for enabling TLS), you should deploy your TLS CA first and use its root certificate when bootstrapping your enrollment CA. This TLS certificate will also be used by the ``fabric-ca client`` when connecting to the enrollment CA to enroll identities for users and nodes.
ml: ട്രാൻസ്പോർട്ട് ലേയർ സെക്യൂരിറ്റി (ടി‌എൽ‌എസ്) യിൽ ആശയവിനിമയം സുരക്ഷിതമാക്കാൻ ഉപയോഗിക്കുന്ന സർ‌ട്ടിഫിക്കറ്റുകൾ‌ മറ്റ് സി‌എ സൃഷ്ടിക്കുന്നു. ഇക്കാരണത്താൽ, ഈ സി‌എയെ പലപ്പോഴും "ടി‌എൽ‌എസ് സി‌എ " എന്ന് വിളിക്കുന്നു. "മാന് ഇൻ ദി മിഡ്‌ഡിൽ "" "ആക്രമണങ്ങളെ തടയുന്നതിനുള്ള ഒരു മാർഗമായി ഈ ടി‌എൽ‌എസ് സർ‌ട്ടിഫിക്കറ്റുകൾ‌ പ്രവർ‌ത്തനങ്ങളുമായി ബന്ധിപ്പിച്ചിരിക്കുന്നു. ടി‌എൽ‌എസ് സി‌എ നോഡുകൾ‌ക്കായി സർ‌ട്ടിഫിക്കറ്റുകൾ‌ നൽ‌കുന്നതിന് മാത്രമേ ഉപയോഗിക്കുന്നുള്ളൂവെന്നും ആ പ്രവർ‌ത്തനം പൂർത്തിയാകുമ്പോൾ‌ അത് ഷട്ട് ഡ can ൺ‌ ചെയ്യാമെന്നും ശ്രദ്ധിക്കുക. ഉപയോക്താക്കൾക്ക് ഒരു വഴി (ക്ലയന്റ് മാത്രം) ടി‌എൽ‌എസും ടു വേ (സെർ‌വർ‌, ക്ലയൻറ്) ടി‌എൽ‌എസും ഉപയോഗിക്കാനുള്ള ഓപ്ഷനുണ്ട്, രണ്ടാമത്തേത് "മ്യൂച്വൽ ടി‌എൽ‌എസ് " എന്നും അറിയപ്പെടുന്നു. നിങ്ങളുടെ നെറ്റ്‌വർക്ക് ടി‌എൽ‌എസ് ഉപയോഗിക്കുമെന്ന് വ്യക്തമാക്കുന്നതിനാൽ (ഇത് ശുപാർശചെയ്യുന്നു) "എൻറോൾമെന്റ് CA" സി‌എ വിന്യസിക്കുന്നതിന് മുമ്പ് തീരുമാനിക്കണം (ഈ സി‌എയുടെ കോൺഫിഗറേഷൻ വ്യക്തമാക്കുന്ന YAML ഫയലിന് ടി‌എൽ‌എസ് പ്രവർത്തനക്ഷമമാക്കുന്നതിന് ഒരു ഫീൽഡ് ഉണ്ട്), നിങ്ങൾ നിങ്ങളുടെ ടി‌എൽ‌എസ് സി‌എ വിന്യസിക്കണം ആദ്യം നിങ്ങളുടെ എൻ‌റോൾ‌മെന്റ് സി‌എ ബൂട്ട് സ്ട്രാപ്പ് ചെയ്യുമ്പോൾ അതിന്റെ റൂട്ട് സർ‌ട്ടിഫിക്കറ്റ് ഉപയോഗിക്കുക. ഉപയോക്താക്കൾക്കും നോഡുകൾക്കുമായി ഐഡന്റിറ്റികൾ എൻറോൾ ചെയ്യുന്നതിന് എൻറോൾമെന്റ് സി‌എയിലേക്ക് കണക്റ്റുചെയ്യുമ്പോൾ ഈ ടി‌എൽ‌എസ് സർ‌ട്ടിഫിക്കറ്റ് ``ഫാബ്രിക്-സി ക്ലയൻറ്`` ഉപയോഗിക്കും.

source: While all of the non-TLS certificates associated with an organization can be created by a single "root" CA (that is, a CA that is its own root of trust), for added security organizations can decide to use "intermediate" CAs whose certificates are created by a root CA (or another intermediate CA that eventually leads back to a root CA). Because a compromise in the root CA leads to a collapse for its entire trust domain (the certs for the admins, nodes, and any CAs it has generated certificates for), intermediate CAs are a useful way to limit the exposure of the root CA. Whether you choose to use intermediate CAs will depend on the needs of your use case. They are not mandatory. Note that it is also possible to configure a Lightweight Directory Access Protocol (LDAP) to manage identities on a Fabric network for those enterprises that already have this implementation and do not want to add a layer of identity management to their existing infrastructure. The LDAP effectively pre registers all of the members of the directory and allows them to enroll based on the criteria given.
ml: ഒരു ഓർ‌ഗനൈസേഷനുമായി ബന്ധപ്പെട്ട എല്ലാ ടി‌എൽ‌എസ് ഇതര സർ‌ട്ടിഫിക്കറ്റുകളും ഒരൊറ്റ " റൂട്ട് " സി‌എ (അതായത്, വിശ്വാസ്യതയുടെ സ്വന്തം റൂട്ട് ആയ ഒരു സി‌എ) സൃഷ്ടിക്കാൻ‌ കഴിയുമെങ്കിലും, അധിക സുരക്ഷാ ഓർ‌ഗനൈസേഷനുകൾ‌ക്ക് "ഇന്റർമീഡിയറ്റ് " ഉപയോഗിക്കാൻ തീരുമാനിക്കാം ഒരു "റൂട്ട്" സി‌എ (അല്ലെങ്കിൽ ഒടുവിൽ റൂട്ട് സി‌എയിലേക്ക് നയിക്കുന്ന മറ്റൊരു ഇന്റർമീഡിയറ്റ് സി‌എ) സൃഷ്ടിച്ച സർ‌ട്ടിഫിക്കറ്റുകൾ‌. റൂട്ട് സി‌എയിലെ ഒരു വിട്ടുവീഴ്ച അതിന്റെ മുഴുവൻ ട്രസ്റ്റ് ഡൊമെയ്‌നിനും (അഡ്‌മിനുകൾ‌, നോഡുകൾ‌, കൂടാതെ സർ‌ട്ടിഫിക്കറ്റുകൾ‌ സൃഷ്‌ടിച്ച ഏതെങ്കിലും സി‌എകൾ‌ എന്നിവയ്‌ക്കായുള്ള സർ‌ട്ടിഫിക്കറ്റുകൾ‌) ഒരു തകർച്ചയിലേക്ക് നയിക്കുന്നു, റൂട്ട് സി‌എയുടെ എക്‌സ്‌പോഷർ‌ പരിമിതപ്പെടുത്തുന്നതിനുള്ള ഒരു ഉപാധിയാണ് ഇന്റർമീഡിയറ്റ് സി‌എകൾ‌. നിങ്ങൾ ഇന്റർമീഡിയറ്റ് സി‌എകൾ ഉപയോഗിക്കാൻ തിരഞ്ഞെടുക്കുകയാണോ എന്നത് നിങ്ങളുടെ ഉപയോഗ കേസിന്റെ ആവശ്യങ്ങളെ ആശ്രയിച്ചിരിക്കും. അവ നിർബന്ധമല്ല. ഇതിനകം തന്നെ ഈ നടപ്പാക്കൽ ഉള്ളതും നിലവിലുള്ള ഇൻഫ്രാസ്ട്രക്ചറിലേക്ക് ഐഡന്റിറ്റി മാനേജുമെന്റിന്റെ ഒരു പാളി ചേർക്കാൻ ആഗ്രഹിക്കാത്തതുമായ സംരംഭങ്ങൾക്കായി ഒരു ഫാബ്രിക് നെറ്റ്‌വർക്കിൽ ഐഡന്റിറ്റികൾ നിയന്ത്രിക്കുന്നതിന് ലൈറ്റ്വെയിറ്റ് ഡയറക്ടറി ആക്സസ് പ്രോട്ടോക്കോൾ (എൽഡിഎപി) കോൺഫിഗർ ചെയ്യാനും സാധ്യമാണ്. ഡയറക്ടറിയിലെ എല്ലാ അംഗങ്ങളെയും എൽ‌ഡി‌എപി ഫലപ്രദമായി മുൻ‌കൂട്ടി രജിസ്റ്റർ ചെയ്യുകയും നൽകിയിരിക്കുന്ന മാനദണ്ഡങ്ങൾക്കനുസരിച്ച് എൻറോൾ ചെയ്യാൻ അനുവദിക്കുകയും ചെയ്യുന്നു.

source: **In a production network, it is recommended to deploy at least one CA per organization for enrollment purposes and another for TLS.** For example, if you deploy three peers that are associated with one organization and an ordering node that is associated with an ordering organization, you will need at least four CAs. Two of the CAs will be for the peer organization (generating the enrollment and TLS certificates for the peer, admins, communications, and the folder structure of the MSP representing the organization) and the other two will be for the orderer organization. Note that users will generally only register and enroll with the enrollment CA, while nodes will register and enroll with both the enrollment CA (where the node will get its signing certificates that identify it when it attempts to sign its actions) and with the TLS CA (where it will get the TLS certificates it uses to authenticate its communications).
ml: **ഒരു പ്രൊഡക്ഷൻ നെറ്റ്‌വർക്കിൽ, എൻറോൾമെന്റ് ആവശ്യങ്ങൾക്കായി ഒരു ഓർഗനൈസേഷന് കുറഞ്ഞത് ഒരു സിഎയും ടി‌എൽ‌എസിനായി മറ്റൊന്നും വിന്യസിക്കാൻ ശുപാർശ ചെയ്യുന്നു.** ഉദാഹരണത്തിന്, ഒരു ഓർഗനൈസേഷനുമായി ബന്ധപ്പെട്ടിരിക്കുന്ന മൂന്ന് സമപ്രായക്കാരെയും ഒരു ഓർഡറിംഗ് ഓർഗനൈസേഷനുമായി ബന്ധപ്പെട്ട ഒരു ഓർഡറിംഗ് നോഡിനെയും നിങ്ങൾ വിന്യസിക്കുകയാണെങ്കിൽ, നിങ്ങൾക്ക് കുറഞ്ഞത് നാല് സി‌എകളെങ്കിലും ആവശ്യമാണ്. സി‌എകളിൽ രണ്ടെണ്ണം പിയർ ഓർ‌ഗനൈസേഷനായിരിക്കും (പിയർ‌, അഡ്മിൻ‌മാർ‌, ആശയവിനിമയങ്ങൾ‌, ഓർ‌ഗനൈസേഷനെ പ്രതിനിധീകരിക്കുന്ന എം‌എസ്‌പിയുടെ ഫോൾ‌ഡർ‌ ഘടന എന്നിവയ്‌ക്കായി എൻ‌റോൾ‌മെൻറ്, ടി‌എൽ‌എസ് സർ‌ട്ടിഫിക്കറ്റുകൾ‌ സൃഷ്‌ടിക്കുന്നു), മറ്റ് രണ്ട് ഓർ‌ഡറർ‌ ഓർ‌ഗനൈസേഷനായിരിക്കും. ഉപയോക്താക്കൾ സാധാരണയായി എൻ‌റോൾ‌മെന്റ് സി‌എയിൽ മാത്രമേ രജിസ്റ്റർ ചെയ്യുകയും എൻ‌റോൾ ചെയ്യുകയും ചെയ്യുകയുള്ളൂ, അതേസമയം നോഡുകൾ‌ എൻ‌റോൾ‌മെന്റ് സി‌എയിൽ രജിസ്റ്റർ ചെയ്യുകയും എൻ‌റോൾ ചെയ്യുകയും ചെയ്യും (ഇവിടെ നോഡിന് അതിന്റെ പ്രവർ‌ത്തനങ്ങളിൽ‌ ഒപ്പിടാൻ‌ ശ്രമിക്കുമ്പോൾ‌ അത് തിരിച്ചറിയുന്ന സൈനിംഗ് സർ‌ട്ടിഫിക്കറ്റുകൾ‌ ലഭിക്കും) കൂടാതെ ടി‌എൽ‌എസ് സി‌എയും (അവിടെ അതിന്റെ ആശയവിനിമയങ്ങൾ പ്രാമാണീകരിക്കുന്നതിന് ഉപയോഗിക്കുന്ന ടി‌എൽ‌എസ് സർ‌ട്ടിഫിക്കറ്റുകൾ‌ ലഭിക്കും).

source: To install the Fabric CA client, which is used to register and enroll identities, follow the instructions in `the Fabric CA User's Guide <https://hyperledger-fabric-ca.readthedocs.io/en/latest/users-guide.html#overview>`_. Note that there are a number of configuration options when deploying a CA (the database type, for example, or whether to use LDAP).
ml: ഐഡന്റിറ്റികൾ രജിസ്റ്റർ ചെയ്യുന്നതിനും എൻറോൾ ചെയ്യുന്നതിനും ഉപയോഗിക്കുന്ന ഫാബ്രിക് സിഎ ക്ലയന്റ് ഇൻസ്റ്റാൾ ചെയ്യുന്നതിന്, ലെ നിർദ്ദേശങ്ങൾ പാലിക്കുക `ഫാബ്രിക് സി‌എ ഉപയോക്തൃ ഗൈഡ് <https://hyperledger-fabric-ca.readthedocs.io/en/latest/users-guide.html#overview>`_. ഒരു സി‌എ വിന്യസിക്കുമ്പോൾ നിരവധി കോൺഫിഗറേഷൻ ഓപ്ഷനുകൾ ഉണ്ടെന്ന കാര്യം ശ്രദ്ധിക്കുക (ഡാറ്റാബേസ് തരം, ഉദാഹരണത്തിന്, അല്ലെങ്കിൽ LDAP ഉപയോഗിക്കണോ).

source: For an example of how to setup a CA and enroll its admin, check out `Setup Orderer Org CA <https://hyperledger-fabric-ca.readthedocs.io/en/latest/operations_guide.html#setup-orderer-org-ca>`_. For an example of how to set up a TLS CA, check out `Setup TLS CA <https://hyperledger-fabric-ca.readthedocs.io/en/latest/operations_guide.html#setup-tls-ca>`_. Note that bootstrapping the CA server means assigning a username and password that functions as "registering" the CA admin.
ml: ഒരു സി‌എ സജ്ജീകരിച്ച് അതിന്റെ അഡ്‌മിൻ എൻറോൾ ചെയ്യുന്നതെങ്ങനെയെന്നതിന്റെ ഉദാഹരണത്തിനായി, പരിശോധിക്കുക `ഓർ‌ഡറർ‌ ഓർ‌ഗ് സി‌എ സജ്ജമാക്കുക <https://hyperledger-fabric-ca.readthedocs.io/en/latest/operations_guide.html#setup-orderer-org-ca>`_. സി‌എ സെർ‌വർ‌ ബൂട്ട്‌സ്‌ട്രാപ്പ് ചെയ്യുകയെന്നാൽ CA അഡ്മിൻ‌ "രജിസ്റ്റർ‌ " ആയി പ്രവർത്തിക്കുന്ന ഒരു ഉപയോക്തൃനാമവും പാസ്‌വേഡും നൽകുക.

source: Step four: Use the CA to create identities and MSPs
ml: ഘട്ടം നാല്: ഐഡന്റിറ്റികളും എം‌എസ്‌പികളും സൃഷ്ടിക്കാൻ സി‌എ ഉപയോഗിക്കുക

source: After you have created your CAs, you can use them to create the certificates for the identities and components related to your organization (which is represented by an MSP). For each organization, you will need to, at a minimum:
ml: നിങ്ങളുടെ സി‌എകൾ‌ സൃഷ്‌ടിച്ച ശേഷം, നിങ്ങളുടെ ഓർ‌ഗനൈസേഷനുമായി ബന്ധപ്പെട്ട ഐഡന്റിറ്റികൾ‌ക്കും ഘടകങ്ങൾ‌ക്കുമായി സർ‌ട്ടിഫിക്കറ്റുകൾ‌ സൃഷ്‌ടിക്കുന്നതിന് അവ ഉപയോഗിക്കാൻ‌ കഴിയും (ഇത് ഒരു എം‌എസ്‌പി പ്രതിനിധീകരിക്കുന്നു). ഓരോ ഓർഗനൈസേഷനും, നിങ്ങൾ കുറഞ്ഞത് ചെയ്യേണ്ടതുണ്ട്:

source: **Register and enroll an admin identity and create an MSP**. After the CA that will be associated with an organization has been created, it can be used to first register an identity and then enroll it. In the first step, a username and password for the identity is assigned by the admin of the CA. Attributes and affiliations can also be given to the identity (for example, a ``role`` of ``admin``, which is necessary for organization admins). After the identity has been registered, it can be enrolled by using the username and password. The CA will generate two certificates for this identity --- a public certificate (also known as a signcert) known to the other members of the network, and the private key (stored in the ``keystore`` folder) used to sign actions taken by the identity. The CA will also generate an MSP file containing the public certificate of the CA issuing the certificate and the root of trust for the CA (this may or may not be the same CA). This MSP can be thought of as defining the organization associated with the identity of the admin. For an example of how this process looks, check out the `this example of how an admin is enrolled <https://hyperledger-fabric-ca.readthedocs.io/en/latest/operations_guide.html#enroll-org1-s-admin>`_. In cases where the admin of the org will also be an admin of a node (which will be typical), **you must create the org admin identity before creating the local MSP of a node, since the certificate of the node admin must be used when creating the local MSP**.
ml: **ഒരു അഡ്മിൻ ഐഡന്റിറ്റി രജിസ്റ്റർ ചെയ്യുകയും എൻറോൾ ചെയ്യുകയും ഒരു എം‌എസ്‌പി സൃഷ്ടിക്കുകയും ചെയ്യുക**. ഒരു ഓർഗനൈസേഷനുമായി ബന്ധപ്പെട്ടിരിക്കുന്ന സി‌എ സൃഷ്ടിച്ച ശേഷം, ആദ്യം ഒരു ഐഡന്റിറ്റി രജിസ്റ്റർ ചെയ്യാനും അത് എൻറോൾ ചെയ്യാനും ഇത് ഉപയോഗിക്കാം. ആദ്യ ഘട്ടത്തിൽ, ഐഡന്റിറ്റിക്കായി ഒരു ഉപയോക്തൃനാമവും പാസ്‌വേഡും നൽകുന്നത് സി‌എയുടെ അഡ്‌മിൻ ആണ്. ഐഡന്റിറ്റിക്കും ആട്രിബ്യൂട്ടുകളും അഫിലിയേഷനുകളും നൽകാം (ഉദാഹരണത്തിന്, ഓർഗനൈസേഷൻ അഡ്മിൻമാർക്ക് ആവശ്യമുള്ള ``അഡ്മിൻ`` ന്റെ ``റോൾ`` ). ഐഡന്റിറ്റി രജിസ്റ്റർ ചെയ്ത ശേഷം, ഉപയോക്തൃനാമവും പാസ്‌വേഡും ഉപയോഗിച്ച് ഇത് എൻറോൾ ചെയ്യാം. ഈ ഐഡന്റിറ്റിക്കായി സി‌എ രണ്ട് സർ‌ട്ടിഫിക്കറ്റുകൾ‌ ജനറേറ്റുചെയ്യും --- നെറ്റ്‌വർക്കിലെ മറ്റ് അംഗങ്ങൾക്ക് അറിയാവുന്ന ഒരു പൊതു സർ‌ട്ടിഫിക്കറ്റ് (സൈൻ‌സെർട്ട് എന്നും അറിയപ്പെടുന്നു), കൂടാതെ പ്രവർ‌ത്തനങ്ങളിൽ‌ ഒപ്പിടാൻ ഉപയോഗിക്കുന്ന സ്വകാര്യ കീ (``കീസ്റ്റോർ`` ഫോൾ‌ഡറിൽ‌ സംഭരിച്ചിരിക്കുന്നു) ഐഡന്റിറ്റി എടുത്തതാണ്. സർ‌ട്ടിഫിക്കറ്റ് നൽ‌കുന്ന സി‌എയുടെ പബ്ലിക് സർ‌ട്ടിഫിക്കറ്റും സി‌എയ്ക്കുള്ള വിശ്വാസത്തിൻറെ റൂട്ടും അടങ്ങിയ ഒരു എം‌എസ്‌പി ഫയലും സി‌എ സൃഷ്ടിക്കും (ഇത് ഒരേ സി‌എ ആയിരിക്കാം അല്ലെങ്കിൽ ഉണ്ടാകില്ല). ഈ എം‌എസ്‌പിയെ അഡ്‌മിന്റെ ഐഡന്റിറ്റിയുമായി ബന്ധപ്പെട്ട ഓർഗനൈസേഷനെ നിർവചിക്കുന്നതായി കണക്കാക്കാം. ഈ പ്രോസസ്സ് എങ്ങനെ കാണപ്പെടുന്നു എന്നതിന്റെ ഒരു ഉദാഹരണത്തിനായി, `ഒരു അഡ്മിൻ എൻറോൾ ചെയ്തതിന്റെ ഈ ഉദാഹരണം പരിശോധിക്കുക <https://hyperledger-fabric-ca.readthedocs.io/en/latest/operations_guide.html#enroll-org1-s-admin>`_. ഓർഗിന്റെ അഡ്‌മിൻ ഒരു നോഡിന്റെ അഡ്‌മിൻ ആകുന്ന സന്ദർഭങ്ങളിൽ (ഇത് സാധാരണമായിരിക്കും), **ഒരു നോഡിന്റെ പ്രാദേശിക എം‌എസ്‌പി സൃഷ്ടിക്കുന്നതിന് മുമ്പ് നിങ്ങൾ ഓർഗ് അഡ്മിൻ ഐഡന്റിറ്റി സൃഷ്‌ടിക്കണം, കാരണം നോഡ് അഡ്മിന്റെ സർട്ടിഫിക്കറ്റ് എപ്പോൾ ഉപയോഗിക്കണം പ്രാദേശിക എം‌എസ്‌പി സൃഷ്‌ടിക്കുന്നു**.

source: **Register and enroll node identities**. Just as an org admin identity is registered and enrolled, the identity of a node must be registered and enrolled with both an enrollment CA and the TLS CA. For this reason, it can be useful for your enrollment CA and TLS to share a database (which allows the node identity to only be registered once and enrolled by each CA server separately), though this is an optional configuration option. Instead of giving a node a role of ``admin`` or ``user`` when registering it with the enrollment CA, give it a role of ``peer`` or ``orderer``. As with the admin, attributes and affiliations for this identity can also be assigned. The MSP structure for a node is known as a "local MSP", since the permissions assigned to the identities are only relevant at the local (node) level. This MSP is created when the node identity is created, and is used when bootstrapping the node. You will use the TLS root certificate generated when enrolling with the TLS CA when joining your organization to the channel (this certificate must be added to the org MSP that was created when you enrolled your admin) and when using the peer binary as a CLI client to make calls to other peers (as in ``peer chaincode invoke``) or ordering nodes (as in ``peer channel fetch``) because there is no ``orderer`` CLI. It is not necessary to add the TLS root certificates to the local MSP of a node because these certificates are contained in the channel configuration.
ml: **നോഡ് ഐഡന്റിറ്റികൾ രജിസ്റ്റർ ചെയ്യുകയും എൻറോൾ ചെയ്യുകയും ചെയ്യുക**. ഒരു org അഡ്മിൻ ഐഡന്റിറ്റി രജിസ്റ്റർ ചെയ്യുകയും എന്നിവയിൽ എൻ‌റോൾ ചെയ്യുകയും വേണം. ഇക്കാരണത്താൽ, നിങ്ങളുടെ എൻ‌റോൾ‌മെന്റ് സി‌എ, ടി‌എൽ‌എസ് എന്നിവയ്ക്ക് ഒരു ഡാറ്റാബേസ് പങ്കിടുന്നത് ഉപയോഗപ്രദമാകും (ഇത് നോഡ് ഐഡന്റിറ്റി ഒരു തവണ മാത്രം രജിസ്റ്റർ ചെയ്യാനും ഓരോ സിഎ സെർവറിനും വെവ്വേറെ എൻറോൾ ചെയ്യാനും അനുവദിക്കുന്നു), ഇത് ഒരു ഓപ്‌ഷണൽ കോൺഫിഗറേഷൻ ഓപ്ഷനാണെങ്കിലും. എൻറോൾമെന്റ് സി‌എയിൽ രജിസ്റ്റർ ചെയ്യുമ്പോൾ ഒരു നോഡിന് ``അഡ്മിൻ‌`` അല്ലെങ്കിൽ‌ ``ഉപയോക്താവ്`` എന്നതിന് ഒരു റോൾ നൽകുന്നതിനുപകരം, അത് ``പിയർ`` അല്ലെങ്കിൽ ``ഓർ‌ഡറർ`` എന്നതിന്റെ ഒരു റോൾ നൽകുക. അഡ്‌മിനെപ്പോലെ, ഈ ഐഡന്റിറ്റിയുടെ ആട്രിബ്യൂട്ടുകളും അഫിലിയേഷനുകളും കഴിയും നിയോഗിക്കപ്പെടും. ഒരു നോഡിനായുള്ള എം‌എസ്‌പി ഘടനയെ "ലോക്കൽ എം‌എസ്‌പി " എന്ന് വിളിക്കുന്നു, കാരണം ഐഡന്റിറ്റികൾക്ക് നൽകിയിട്ടുള്ള അനുമതികൾ പ്രാദേശിക (നോഡ്) തലത്തിൽ മാത്രമേ പ്രസക്തമാകൂ. നോഡ് ഐഡന്റിറ്റി സൃഷ്ടിക്കുമ്പോൾ ഈ MSP സൃഷ്ടിക്കപ്പെടുന്നു, കൂടാതെ നോഡ് ബൂട്ട് സ്ട്രാപ്പ് ചെയ്യുമ്പോൾ ഇത് ഉപയോഗിക്കുന്നു. നിങ്ങളുടെ ഓർഗനൈസേഷനിൽ ചാനലിലേക്ക് ചേരുമ്പോൾ ടി‌എൽ‌എസ് സി‌എയിൽ ചേരുമ്പോൾ ജനറേറ്റുചെയ്ത ടി‌എൽ‌എസ് റൂട്ട് സർ‌ട്ടിഫിക്കറ്റ് നിങ്ങൾ ഉപയോഗിക്കും (നിങ്ങളുടെ അഡ്‌മിൻ എൻറോൾ ചെയ്യുമ്പോൾ സൃഷ്ടിച്ച ഓർഗ് എം‌എസ്‌പിയിലേക്ക് ഈ സർട്ടിഫിക്കറ്റ് ചേർക്കേണ്ടതാണ്) കൂടാതെ പിയർ ബൈനറി ഒരു സി‌എൽ‌ഐ ക്ലയന്റായി ഉപയോഗിക്കുമ്പോൾ മറ്റ് സഹപാഠികളിലേക്ക് വിളിക്കാൻ (``പിയർ ചെയിൻ‌കോഡ് ഇൻ‌വോക്ക്`` പോലെ) അല്ലെങ്കിൽ നോഡുകൾ‌ ഓർ‌ഡർ‌ ചെയ്യുന്നതിന് (``പിയർ‌ ചാനൽ‌ ലഭ്യമാക്കൽ‌` പോലെ) ``ഓർ‌ഡറർ‌`` CLI ഇല്ലാത്തതിനാൽ‌. ചാനൽ കോൺഫിഗറേഷനിൽ ഈ സർട്ടിഫിക്കറ്റുകൾ അടങ്ങിയിരിക്കുന്നതിനാൽ ഒരു നോഡിന്റെ പ്രാദേശിക എം‌എസ്‌പിയിലേക്ക് ടി‌എൽ‌എസ് റൂട്ട് സർട്ടിഫിക്കറ്റുകൾ ചേർക്കേണ്ട ആവശ്യമില്ല.

source: For more conceptual information about identities and permissions in a Fabric-based blockchain network, see :doc:`identity/identity` and :doc:`membership/membership.html`.
ml: ഒരു ഫാബ്രിക് അധിഷ്‌ഠിത ബ്ലോക്ക്‌ചെയിൻ നെറ്റ്‌വർക്കിലെ ഐഡന്റിറ്റികളെയും അനുമതികളെയും കുറിച്ചുള്ള കൂടുതൽ ആശയപരമായ വിവരങ്ങൾക്ക്, കാണുക ,` :doc:`identity/identity` and :doc:`membership/membership`.

source: For a look at how to use a CA to generate an admin identity and MSP, check out `Enroll Org1's Admin <https://hyperledger-fabric-ca.readthedocs.io/en/latest/operations_guide.html#enroll-org1-s-admin>`_.
ml: ഒരു അഡ്‌മിൻ ഐഡന്റിറ്റിയും എം‌എസ്‌പിയും സൃഷ്ടിക്കുന്നതിന് ഒരു സി‌എ എങ്ങനെ ഉപയോഗിക്കാമെന്നറിയാൻ, `എൻ‌റോൾ ഓർ‌ഗ് 1 ന്റെ അഡ്‌മിൻ‌ പരിശോധിക്കുക <https://hyperledger-fabric-ca.readthedocs.io/en/latest/operations_guide.html#enroll-org1-s-admin>`_.

source: To see how to use the enrollment CA to and the TLS CA to generate the certificates for a node, check out `Setup Org1's Peers <https://hyperledger-fabric-ca.readthedocs.io/en/latest/operations_guide.html#setup-org1-s-peers>`_.
ml: ഒരു നോഡിനായി സർ‌ട്ടിഫിക്കറ്റുകൾ‌ ജനറേറ്റ് ചെയ്യുന്നതിന് എൻ‌റോൾ‌മെന്റ് സി‌എയും ടി‌എൽ‌എസ് സി‌എയും എങ്ങനെ ഉപയോഗിക്കാമെന്ന് കാണാൻ, `ഓർ‌ഗ്‌ 1 ന്റെ പിയറുകളെ സജ്ജമാക്കുക <https://hyperledger-fabric-ca.readthedocs.io/en/latest/operations_guide.html#setup-org1-s-peers>`_.

source: Step five: Deploy nodes
ml: ഘട്ടം അഞ്ച്: നോഡുകൾ വിന്യസിക്കുക

source: Once you have gathered all of the certificates and MSPs you need, you're almost ready to create a node. As discussed above, there are a number of valid ways to deploy nodes.
ml: നിങ്ങൾക്ക് ആവശ്യമായ എല്ലാ സർട്ടിഫിക്കറ്റുകളും എം‌എസ്‌പികളും ശേഖരിച്ചുകഴിഞ്ഞാൽ, നിങ്ങൾ ഒരു നോഡ് സൃഷ്ടിക്കാൻ ഏകദേശം തയ്യാറാണ്. മുകളിൽ ചർച്ച ചെയ്തതുപോലെ, നോഡുകൾ വിന്യസിക്കുന്നതിന് സാധുവായ നിരവധി മാർഗങ്ങളുണ്ട്.

source: Create a peer
ml: ഒരു പിയർ സൃഷ്ടിക്കുക

source: Before you can create a peer, you will need to customize the configuration file for the peer. In Fabric, this file is called ``core.yaml``. You can find a sample ``core.yaml`` configuration file `in the sampleconfig directory of Hyperledger Fabric <https://github.com/hyperledger/fabric/blob/master/sampleconfig/core.yaml>`_.
ml: നിങ്ങൾക്ക് ഒരു പിയർ സൃഷ്ടിക്കുന്നതിന് മുമ്പ്, നിങ്ങൾ പിയറിനായി കോൺഫിഗറേഷൻ ഫയൽ ഇച്ഛാനുസൃതമാക്കേണ്ടതുണ്ട്. ഫാബ്രിക്കിൽ, ഈ ഫയലിനെ ``core.yaml`` എന്ന് വിളിക്കുന്നു. ഹൈപ്പർലെഡ്ജർ ഫാബ്രിക്കിന്റെ സാമ്പിൾ കോൺഫിഗറേഷൻ ഡയറക്‌ടറിയിൽ നിങ്ങൾക്ക് ``core.yaml`` `കോൺഫിഗറേഷൻ ഫയൽ കണ്ടെത്താനാകും <https://github.com/hyperledger/fabric/blob/master/sampleconfig/core.yaml>`_.

source: As you can see in the file, there are quite a number of parameters you either have the option to set or will need to set for your node to work properly. In general, if you do not have the need to change a tuning value, leave it alone. You will, however, likely need to adjust the various addresses, specify the database type you want to use, as well as to specify where the MSP for the node is located.
ml: ഫയലിൽ നിങ്ങൾക്ക് കാണാനാകുന്നതുപോലെ, നിങ്ങൾക്ക് സജ്ജീകരിക്കാനുള്ള ഓപ്‌ഷനുള്ള നിരവധി പാരാമീറ്ററുകൾ ഉണ്ട് അല്ലെങ്കിൽ നിങ്ങളുടെ നോഡ് ശരിയായി പ്രവർത്തിക്കുന്നതിന് സജ്ജമാക്കേണ്ടതുണ്ട്. പൊതുവേ, നിങ്ങൾക്ക് ഒരു ട്യൂണിംഗ് മൂല്യം മാറ്റേണ്ട ആവശ്യമില്ലെങ്കിൽ, അത് ഉപേക്ഷിക്കുക. എന്നിരുന്നാലും, നിങ്ങൾക്ക് വിവിധ വിലാസങ്ങൾ ക്രമീകരിക്കാനും നിങ്ങൾ ഉപയോഗിക്കാൻ ആഗ്രഹിക്കുന്ന ഡാറ്റാബേസ് തരം വ്യക്തമാക്കാനും നോഡിനായുള്ള എം‌എസ്‌പി എവിടെയാണെന്ന് വ്യക്തമാക്കാനും ആവശ്യമാണ്.

source: You have two main options for tuning your configuration.
ml: നിങ്ങളുടെ കോൺഫിഗറേഷൻ ട്യൂൺ ചെയ്യുന്നതിന് നിങ്ങൾക്ക് രണ്ട് പ്രധാന ഓപ്ഷനുകൾ ഉണ്ട്.

source: Edit the YAML file bundled with the binaries.
ml: ബൈനറികൾക്കൊപ്പം ചേർത്ത YAML ഫയൽ എഡിറ്റുചെയ്യുക.

source: Use environment variable overrides when deploying.
ml: വിന്യസിക്കുമ്പോൾ പരിസ്ഥിതി വേരിയബിൾ ഓവർറൈഡുകൾ ഉപയോഗിക്കുക.

source: Specify flags on CLI commands.
ml: CLI കമാൻഡുകളിൽ ഫ്ലാഗുകൾ വ്യക്തമാക്കുക.

source: Option 1 has the advantage of persisting your changes whenever you bring down and bring back up the node. The downside is that you will have to port the options you customized to the new YAML when upgrading to a new binary version (you should use the latest YAML when upgrading to a new version).
ml: നിങ്ങൾ താഴേക്കിറങ്ങുകയും നോഡ് തിരികെ കൊണ്ടുവരികയും ചെയ്യുമ്പോഴെല്ലാം നിങ്ങളുടെ മാറ്റങ്ങൾ തുടരുന്നതിന്റെ ഗുണം ഓപ്ഷൻ 1 ന് ഉണ്ട്. ഒരു പുതിയ ബൈനറി പതിപ്പിലേക്ക് അപ്‌ഗ്രേഡുചെയ്യുമ്പോൾ നിങ്ങൾ പുതിയ YAML- ലേക്ക് ഇഷ്‌ടാനുസൃതമാക്കിയ ഓപ്‌ഷനുകൾ പോർട്ട് ചെയ്യേണ്ടിവരും (ഒരു പുതിയ പതിപ്പിലേക്ക് അപ്‌ഗ്രേഡുചെയ്യുമ്പോൾ നിങ്ങൾ ഏറ്റവും പുതിയ YAML ഉപയോഗിക്കണം).

source: Either way, here are some values in ``core.yaml`` you must review.
ml: ഏതുവിധേനയും, നിങ്ങൾ അവലോകനം ചെയ്യേണ്ട ` `core.yaml`` ലെ ചില സാമ്പിളുകൾ ഇതാ.

source: ``peer.localMspID``: this is the name of the local MSP of your peer organization. This MSP is where your peer organization admins will be listed as well as the peer organization's root CA and TLS CA certificates.
ml: ``peer.localMspID``: നിങ്ങളുടെ പിയർ ഓർഗനൈസേഷന്റെ പ്രാദേശിക എം‌എസ്‌പിയുടെ പേരാണിത്. നിങ്ങളുടെ പിയർ ഓർഗനൈസേഷൻ അഡ്‌മിനുകളെയും പിയർ ഓർഗനൈസേഷന്റെ റൂട്ട് സിഎ, ടിഎൽഎസ് സിഎ സർട്ടിഫിക്കറ്റുകളെയും ലിസ്റ്റുചെയ്യുന്ന ഇടമാണ് ഈ എം‌എസ്‌പി.

source: ``peer.mspConfigPath``: the place where the local MSP for the peer is located. Note that it is a best practice to mount this volume external to your container. This ensures that even if the container is stopped (for example, during a maintenance cycle) that the MSPs are not lost and have to be recreated.
ml: ``peer.mspConfigPath``: പിയറിനായുള്ള പ്രാദേശിക എം‌എസ്‌പി സ്ഥിതിചെയ്യുന്ന സ്ഥലം. നിങ്ങളുടെ കണ്ടെയ്നറിന് പുറത്തേക്ക് ഈ വോളിയം മൌണ്ട് ചെയ്യുന്നത് മികച്ച പരിശീലനമാണെന്ന് ശ്രദ്ധിക്കുക. കണ്ടെയ്നർ നിർത്തിയാലും (ഉദാഹരണത്തിന്, ഒരു മെയിന്റനൻസ് സൈക്കിൾ സമയത്ത്) എം‌എസ്‌പികൾ നഷ്‌ടപ്പെടുന്നില്ലെന്നും പുനസൃഷ്ടിക്കേണ്ടതുണ്ടെന്നും ഇത് ഉറപ്പാക്കുന്നു.

source: ``peer.address``: represents the endpoint to other peers in the same organization, an important consideration when establishing gossip communication within an organization.
ml: ``peer.address``: ഒരേ ഓർഗനൈസേഷനിലെ മറ്റ് സമപ്രായക്കാർക്കുള്ള അന്തിമ പോയിന്റിനെ പ്രതിനിധീകരിക്കുന്നു, ഒരു ഓർഗനൈസേഷനിൽ ഗോസിപ്പ് ആശയവിനിമയം സ്ഥാപിക്കുമ്പോൾ ഒരു പ്രധാന പരിഗണന.

source: ``peer.tls``: When you set the ``enabled`` value to ``true`` (as should be done in a production network), you will have to specify the locations of the relevant TLS certificates. Note that all of the nodes in a network (both the peers and the ordering nodes) must either all have TLS enabled or not enabled. For production networks, it is highly recommended to enable TLS. As with your MSP, it is a best practice to mount this volume external to your container.
ml: ``peer.tls``: നിങ്ങൾ ``enabled`` ന്റെ വാല്യൂ ``true`` (ഒരു പ്രൊഡക്ഷൻ നെറ്റ്‌വർക്കിൽ ചെയ്യേണ്ടത്)എന്നായി സജ്ജമാക്കുമ്പോൾ, പ്രസക്തമായ ടി‌എൽ‌എസ് സർട്ടിഫിക്കറ്റുകളുടെ സ്ഥാനങ്ങൾ നിങ്ങൾ വ്യക്തമാക്കേണ്ടതുണ്ട്. കുറിപ്പ് ഒരു നെറ്റ്‌വർക്കിലെ എല്ലാ നോഡുകളും (സമപ്രായക്കാരും ഓർ‌ഡറിംഗ് നോഡുകളും) ഒന്നുകിൽ ടി‌എൽ‌എസ് പ്രാപ്‌തമാക്കിയിരിക്കണം അല്ലെങ്കിൽ‌ പ്രാപ്‌തമാക്കിയിട്ടില്ല. ഉൽ‌പാദന നെറ്റ്‌വർ‌ക്കുകൾ‌ക്കായി, ടി‌എൽ‌എസ് പ്രാപ്‌തമാക്കുന്നതിന് ഇത് വളരെ ശുപാർശ ചെയ്യുന്നു.നിങ്ങളുടെ എം‌എസ്‌പിയെപ്പോലെ, ഇത് ഒരു മികച്ച പരിശീലനമാണ് ഈ വോളിയം നിങ്ങളുടെ കണ്ടെയ്‌നറിന് പുറത്തേക്ക് മൌണ്ട് ചെയ്യുക.

source: ``ledger``: users have a number of decisions to make about their ledger, including the state database type (LevelDB or CouchDB, for example), and its location (specified in ``fileSystemPath``). Note that for CouchDB in particular it is a best practice to operate your state database external to the peer, as you will be better able to allocate specific resources to the database this way.
ml: ``ലെഡ്‌ജർ‌``: ഉപയോക്താക്കൾ‌ക്ക് അവരുടെ ലെഡ്‌ജറിനെക്കുറിച്ച് സംസ്ഥാന ഡാറ്റാബേസ് തരം (ഉദാഹരണത്തിന് ലെവൽ‌ഡിബി അല്ലെങ്കിൽ കൗച് ഡിബി), അതിന്റെ സ്ഥാനം (``fileSystemPath`` വ്യക്തമാക്കിയത്) എന്നിവ ഉൾപ്പെടെ നിരവധി തീരുമാനങ്ങളുണ്ട്. നിങ്ങളുടെ സംസ്ഥാന ഡാറ്റാബേസ് പിയറിന് പുറത്തേക്ക് പ്രവർത്തിപ്പിക്കുന്നത് കൗച്ഡിബിയെ സംബന്ധിച്ചിടത്തോളം മികച്ച പരിശീലനമാണെന്ന് ശ്രദ്ധിക്കുക, കാരണം ഡാറ്റാബേസിലേക്ക് നിർദ്ദിഷ്ട വിഭവങ്ങൾ ഈ രീതിയിൽ അനുവദിക്കാൻ നിങ്ങൾക്ക് കഴിയും.
