Repository: thomastibin/fabric-docs-ml
Catalog: docs/source/locale/*/LC_MESSAGES/deployment_guide_overview.po
Languages: ml

source: Deploying a production network
ml: ഒരു പ്രൊഡക്ഷൻ നെറ്റ്‌വർക്ക് വികസിപ്പിക്കുന്നു

source: This deployment guide is a high level overview of the proper sequence for setting up production Fabric network components, in addition to best practices and a few of the many considerations to keep in mind when deploying. Note that this topic will discuss "setting up the network" as a holistic process from the perspective of a single individual. More likely than not, real world production networks will not be set up by a single individual but as a collaborative effort directed by several individuals (a collection of banks each setting up their own components, for example) instead.
ml: ഈ വിവരണത്തിൽ ഒരു ഹൈപ്പെർ ഫാബ്രിക് വികസിപ്പിക്കുമ്പോൾ നമ്മള്‌ നോക്കേണ്ട നല്ല രീതികൾ എന്തൊക്കെയാണെന്നും, അതുപോലെതന്നെ വികസിപ്പിക്കാൻ നേരത്ത് നമ്മൾ പാലിക്കേണ്ട ശരിയായ ക്രമങ്ങൾ എങ്ങനെയാണെന്നും കാണിച്ചു തരുന്നു. ഈ വിഷയത്തിൽ പ്രധാനമായി ഒരു സാധാരണ വ്യക്തിയുടെ കാഴ്ചപ്പാടിൽ നിന്നുകൊണ്ട് "ഒരു നെറ്റ്‌വർക്ക് എങ്ങനെ വികസിപ്പിക്കണം " എന്നതാണ് പ്രതിപാദിക്കുന്നത്. ഇങ്ങനെയൊക്കെ ആണെങ്കിലും ശരിക്കും ഒരു പ്രൊഡക്ഷൻ നെറ്റ്‌വർക്ക് ഡെവലപ്പ് ചെയ്യുന്നത് ഒരു വ്യക്തി മാത്രമായിരിക്കില്ല പകരം കുറെ വ്യക്തികളുടെ ഒരുമിച്ചുള്ള പരിശ്രമം മൂലവും , അധികാരികളുടെ നിർദ്ദേശങ്ങൾ പാലിച്ചു കൊണ്ടും ആയിരിക്കും.

source: The process for deploying a Fabric network is complex and presumes an understanding of Public Key Infrastructure and managing distributed systems. If you are a smart contract or application developer, you should not need this level of expertise in deploying a production level Fabric network. However, you might need to be aware of how networks are deployed in order to develop effective smart contracts and applications.
ml: ഒരു ഫാബ്രിക് നെറ്റ്‌വർക്ക് വിന്യസിക്കുന്നതിനുള്ള പ്രക്രിയ സങ്കീർണ്ണമാണ്, കൂടാതെ പബ്ലിക് കീ ഇൻഫ്രാസ്ട്രക്ചറിനെക്കുറിച്ചും വിതരണ സംവിധാനങ്ങൾ കൈകാര്യം ചെയ്യുന്നതിനെക്കുറിച്ചും ഒരു ധാരണ ഉണ്ടാകണം.നിങ്ങൾ ഒരു സ്മാർട്ട് കരാർ അല്ലെങ്കിൽ ആപ്ലിക്കേഷൻ ഡെവലപ്പർ ആണെങ്കിൽ, ഒരു പ്രൊഡക്ഷൻ ലെവൽ ഫാബ്രിക് നെറ്റ്‌വർക്ക് വിന്യസിക്കുന്നതിന് നിങ്ങൾക്ക് ഈ ലെവൽ വൈദഗ്ദ്ധ്യം ആവശ്യമില്ല. എന്നിരുന്നാലും, ഫലപ്രദമായ സ്മാർട്ട് കരാറുകളും ആപ്ലിക്കേഷനുകളും വികസിപ്പിക്കുന്നതിന് നെറ്റ്വർക്കുകൾ എങ്ങനെയാണ് വിന്യസിച്ചിരിക്കുന്നതെന്ന് നിങ്ങൾ അറിഞ്ഞിരിക്കേണ്ടതുണ്ട്.

source: If all you need is a development environment to test chaincode, smart contracts, and applications against, check out :doc:`test_network`. It includes two organizations, each owning one peer, and a single ordering service organization that owns a single ordering node. **This test network is not meant to provide a blueprint for deploying production components, and should not be used as such, as it makes assumptions and decisions that production deployments will not make.**
ml: ചെയിൻ‌കോഡ്, സ്മാർട്ട് കരാറുകൾ‌, കൂടാതെ അപ്ലിക്കേഷനുകൾ‌ എന്നിവ പരീക്ഷിക്കുന്നതിനുള്ള ഒരു വികസന അന്തരീക്ഷം നിങ്ങൾ‌ക്കാവശ്യമുണ്ടെങ്കിൽ‌, ഇത് പരിശോധിക്കുക :doc:`test_network` ഇതിൽ രണ്ട് ഓർഗനൈസേഷനുകൾ ഉൾപ്പെടുന്നു, ഓരോന്നിനും ഒരു പിയർ , അതുപോലെ ഒരു ഓർഡറിംഗ് നോഡ് സ്വന്തമായിട്ട് ഉള്ള ഒരു ഒരു ഓർഡറിംഗ് സേവന ഓർഗനൈസേഷനും ഉണ്ട് . **ഉൽ‌പാദന ഘടകങ്ങൾ‌ വിന്യസിക്കുന്നതിന് ഒരു ബ്ലൂപ്രിൻറ് നൽകുന്നതിനല്ല ഈ ടെസ്റ്റ് നെറ്റ്‌വർക്ക് ഉദ്ദേശിക്കുന്നത്, മാത്രമല്ല ഇത് ഉപയോഗിക്കാൻ‌ പാടില്ല, കാരണം ഉൽ‌പാദന വിന്യാസങ്ങൾ‌ നടത്താത്ത അനുമാനങ്ങളും തീരുമാനങ്ങളും എടുക്കുന്നു.

source: The guide will give you an overview of the steps of setting up production components and a production network:
ml: ഉൽ‌പാദന ഘടകങ്ങളും ഉൽ‌പാദന ശൃംഖലയും സജ്ജീകരിക്കുന്നതിനുള്ള ഘട്ടങ്ങളുടെ ഒരു അവലോകനം ഗൈഡ് നിങ്ങൾക്ക് നൽകും

source: Step one: Decide on your network configuration
ml: ഘട്ടം ഒന്ന്: നിങ്ങളുടെ നെറ്റ്‌വർക്ക് കോൺഫിഗറേഷൻ തീരുമാനിക്കുക

source: The structure of a blockchain network must be dictated by the use case. These fundamental business decisions will vary according to your use case, but let's consider a few scenarios.
ml: ഒരു ബ്ലോക്ക്‌ചെയിൻ നെറ്റ്‌വർക്കിന്റെ ഘടന യൂസ്‌കേസ് നിർണ്ണയിക്കണം. ഈ അടിസ്ഥാന ബിസിനസ്സ് തീരുമാനങ്ങൾ നിങ്ങളുടെ ഉപയോഗത്തിന് അനുസരിച്ച് വ്യത്യാസപ്പെടും, പക്ഷേ കുറച്ച് സാഹചര്യങ്ങൾ പരിഗണിക്കാം.

source: In contrast to development environments or proofs of concept, security, resource management, and high availability become a priority when operating in production. How many nodes do you need to satisfy high availability, and in what data centers do you wish to deploy them in to satisfy both the needs of disaster recovery and data residency? How will you ensure that your private keys and roots of trust remain secure?
ml: വികസന പരിതസ്ഥിതികൾക്കോ ​​ആശയത്തിന്റെ തെളിവുകൾക്കോ ​​വിരുദ്ധമായി, സുരക്ഷ,റിസോഴ്സ് മാനേജ്മെന്റ്, ഉയർന്ന ലഭ്യത എന്നിവ ഉൽ‌പാദനത്തിൽ പ്രവർത്തിക്കുമ്പോൾ ഒരു മുൻ‌ഗണനയായി മാറുന്നു. ഉയർന്ന ലഭ്യത തൃപ്തിപ്പെടുത്താൻ നിങ്ങൾക്ക് എത്ര നോഡുകൾ ആവശ്യമാണ്, കൂടാതെ ദുരന്ത വീണ്ടെടുക്കലിന്റെയും ഡാറ്റാ റെസിഡൻസിയുടെയും ആവശ്യങ്ങൾ നിറവേറ്റുന്നതിനായി ഏത് ഡാറ്റാ സെന്ററുകളിൽ വിന്യസിക്കാൻ നിങ്ങൾ ആഗ്രഹിക്കുന്നു? നിങ്ങളുടെ സ്വകാര്യ കീകളും വിശ്വാസത്തിന്റെ വേരുകളും സുരക്ഷിതമാണെന്ന് നിങ്ങൾ എങ്ങനെ ഉറപ്പാക്കും?

source: In addition to the above, here is a sampling of the decisions you will need to make before deploying components:
ml: മുകളിൽ പറഞ്ഞവയ്‌ക്ക് പുറമേ, ഘടകങ്ങൾ വിന്യസിക്കുന്നതിന് മുമ്പ് നിങ്ങൾ എടുക്കേണ്ട തീരുമാനങ്ങളുടെ ഒരു സാമ്പിൾ ഇവിടെയുണ്ട്.

source: **Certificate Authority configuration**. As part of the overall decisions you have to make about your peers (how many, how many on each channel, and so on) and about your ordering service (how many nodes, who will own them), you also have to decide on how the CAs for your organization will be deployed. Production networks should be using Transport Layer Security (TLS), which will require setting up a TLS CA and using it to generate TLS certficates. This TLS CA will need to be deployed before your enrollment CA. We'll discuss this more in :ref:`dg-step-three-set-up-your-cas`.
ml: **സർട്ടിഫിക്കറ്റ് അതോറിറ്റി കോൺഫിഗറേഷൻ**. നിങ്ങളുടെ സമപ്രായക്കാരെക്കുറിച്ചും (ഓരോ ചാനലിലും എത്രയെണ്ണം, എത്രയെണ്ണം) നിങ്ങളുടെ ഓർഡറിംഗ് സേവനത്തെക്കുറിച്ചും (എത്ര നോഡുകൾ, ആരുടെ ഉടമസ്ഥതയിലുള്ളവർ) എന്നതിനെക്കുറിച്ചും നിങ്ങൾ എടുക്കേണ്ട മൊത്തത്തിലുള്ള തീരുമാനങ്ങളുടെ ഭാഗമായി നിങ്ങൾ തീരുമാനിക്കേണ്ടതുണ്ട് നിങ്ങളുടെ ഓർ‌ഗനൈസേഷനായുള്ള സി‌എകൾ‌ എങ്ങനെ വിന്യസിക്കും ഞങ്ങൾ‌ ഇതിനെക്കുറിച്ച് കൂടുതൽ‌ ചർച്ചചെയ്യും :ref:`dg-step-three-set-up-your-cas`.

source: **Use Organizational Units or not?** Some organizations might find it necessary to establish Organizational Units to create a separation between certain identities and MSPs created by a single CA.
ml: **ഓർ‌ഗനൈസേഷണൽ‌ യൂണിറ്റുകൾ‌ ഉപയോഗിക്കണോ വേണ്ടയോ?** ചില ഐഡന്റിറ്റികളും ഒരു സി‌എ സൃഷ്ടിച്ച എം‌എസ്‌പികളും തമ്മിൽ ഒരു വേർതിരിവ് സൃഷ്ടിക്കുന്നതിന് ഓർ‌ഗനൈസേഷണൽ‌ യൂണിറ്റുകൾ‌ സ്ഥാപിക്കേണ്ടത് ആവശ്യമാണെന്ന് ചില ഓർ‌ഗനൈസേഷനുകൾ‌ കണ്ടെത്തിയേക്കാം.

source: **Database type.** Some channels in a network might require all data to be modeled in a way :doc:`couchdb_as_state_database` can understand, while other networks, prioritizing speed, might decide that all peers will use LevelDB. Note that channels should not have peers that use both CouchDB and LevelDB on them, as the two database types model data slightly differently.
ml: **ഡാറ്റാബേസ് തരം.** ഒരു നെറ്റ്‌വർക്കിലെ ചില ചാനലുകൾക്ക് എല്ലാ ഡാറ്റയും ഒരു വിധത്തിൽ മാതൃകയാക്കേണ്ടതുണ്ട് :doc:`couchdb_as_state_database` ന് മനസിലാക്കാൻ കഴിയും, അതേസമയം മറ്റ് നെറ്റ്‌വർക്കുകൾ, വേഗതയ്ക്ക് മുൻഗണന നൽകിക്കൊണ്ട്, എല്ലാ പിയറും ലെവൽഡിബി ഉപയോഗിക്കുമെന്ന് തീരുമാനിച്ചേക്കാം. രണ്ട് ഡാറ്റാബേസ് തരം മോഡൽ ഡാറ്റ അല്പം വ്യത്യസ്തമായി ഉള്ളതിനാൽ ചാനലുകൾക്ക് കൊച്ച്ഡിബിയും ലെവൽ ഡിബിയും ഉപയോഗിക്കുന്ന പിയറുകളും ഉണ്ടാകരുത്.

source: **Channels and private data.** Some networks might decide that :doc:`channels` are the best way to ensure privacy and isolation for certain transactions. Others might decide that a single channel, along with :doc:`private-data/private-data`, better serves their need for privacy.
ml: **ചാനലുകളും സ്വകാര്യ ഡാറ്റയും.** ചില നെറ്റ്‌വർക്കുകൾ ഇത് തീരുമാനിച്ചേക്കാം :doc:`channels` ചില ഇടപാടുകൾക്കായി സ്വകാര്യതയും ഒറ്റപ്പെടലും ഉറപ്പാക്കാനുള്ള ഏറ്റവും നല്ല മാർഗ്ഗം ചാനലുകൾ. :doc:`private-data/private-data`, എന്നതിനൊപ്പം ഒരൊറ്റ ചാനൽ അവരുടെ സ്വകാര്യതയുടെ ആവശ്യകതയെ മികച്ചതാക്കുന്നുവെന്ന് മറ്റുള്ളവർ തീരുമാനിച്ചേക്കാം.

source: **Container orchestration.** Different users might also make different decisions about their container orchestration, creating separate containers for their peer process, logging for the peer, CouchDB, gRPC communications, and chaincode, while other users might decide to combine some of these processes.
ml: **കണ്ടെയ്നർ ഓർക്കസ്ട്രേഷൻ.** വ്യത്യസ്ത ഉപയോക്താക്കൾ അവരുടെ കണ്ടെയ്നർ ഓർക്കസ്ട്രേഷനെക്കുറിച്ച് വ്യത്യസ്ത തീരുമാനങ്ങൾ എടുക്കുകയും അവരുടെ പിയർ പ്രോസസ്സിനായി പ്രത്യേക കണ്ടെയ്നറുകൾ സൃഷ്ടിക്കുകയും പിയർ, കൊച്ച്ഡിബി, ജിആർപിസി കമ്മ്യൂണിക്കേഷൻസ്, ചെയിൻകോഡ് എന്നിവയ്ക്കായി ലോഗിൻ ചെയ്യുകയും മറ്റ് ഉപയോക്താക്കൾ ചിലത് സംയോജിപ്പിക്കാൻ തീരുമാനിക്കുകയും ചെയ്യാം.

source: **Chaincode deployment method.** Users now have the option to deploy their chaincode using either the built in build and run support, a customized build and run using the :doc:`cc_launcher`, or using an :doc:`cc_service`.
ml: **കണ്ടെയ്നർ ഓർക്കസ്ട്രേഷൻ.** വ്യത്യസ്ത ഉപയോക്താക്കൾ അവരുടെ കണ്ടെയ്നർ ഓർക്കസ്ട്രേഷനെക്കുറിച്ച് വ്യത്യസ്ത തീരുമാനങ്ങൾ എടുക്കുകയും അവരുടെ പിയർ പ്രോസസ്സിനായി പ്രത്യേക കണ്ടെയ്നറുകൾ സൃഷ്ടിക്കുകയും പിയർ, കൊച്ച്ഡിബി, ജിആർപിസി കമ്മ്യൂണിക്കേഷൻസ്, ചെയിൻകോഡ് എന്നിവയ്ക്കായി ലോഗിൻ ചെയ്യുകയും , മറ്റ് ഉപയോക്താക്കൾ ഈ പ്രക്രിയകളിൽ ചിലത് സംയോജിപ്പിക്കാൻ തീരുമാനിച്ചേക്കാം.

source: **Using firewalls.** In a production deployment, components belonging to one organization might need access to components from other organizations, necessitating the use of firewalls and advanced networking configuration. For example, applications using the Fabric SDK require access to all endorsing peers from all organizations and the ordering services for all channels. Similarly, peers need access to the ordering service on the channels that they are receiving new blocks from.
ml: **ഫയർവാളുകൾ ഉപയോഗിക്കുന്നു.** ഒരു നിർമ്മാണ വിന്യാസത്തിൽ, ഒരു ഓർഗനൈസേഷന്റെ ഘടകങ്ങൾക്ക് മറ്റ് ഘടകങ്ങളിൽ നിന്ന് ആക്‌സസ്സ് ആവശ്യമായി വന്നേക്കാം ഓർ‌ഗനൈസേഷനുകൾ‌, ഫയർ‌വാളുകളുടെയും നൂതന നെറ്റ്‌വർ‌ക്കിംഗ് കോൺ‌ഫിഗറേഷന്റെയും ഉപയോഗം ആവശ്യമാണ്. ഉദാഹരണത്തിന്, ഫാബ്രിക് എസ്‌ഡി‌കെ ഉപയോഗിക്കുന്ന അപ്ലിക്കേഷനുകൾ‌ക്ക് എല്ലാ ഓർ‌ഗനൈസേഷനുകളിൽ‌ നിന്നും അംഗീകരിക്കുന്ന എല്ലാ സമപ്രായക്കാരിലേക്കും എല്ലാ ചാനലുകൾ‌ക്കുമുള്ള ഓർ‌ഡറിംഗ് സേവനങ്ങളിലേക്കും ആക്‌സസ് ആവശ്യമാണ്. അതുപോലെ തന്നെ, പുതിയ ബ്ലോക്കുകൾ ലഭിക്കുന്നതിനുവേണ്ടി ചാനലുകളിലെ ഓർ‌ഡറിംഗ് സേവനത്തിലേക്ക് പിയറുകൾക്കു പ്രവേശനം ആവശ്യമാണ്.

source: However and wherever your components are deployed, you will need a high degree of expertise in your management system of choice (such as Kubernetes) in order to efficiently operate your network. Similarly, the structure of the network must be designed to fit the business use case and any relevant laws and regulations government of the industry in which the network will be designed to function.
ml: എന്നിരുന്നാലും, നിങ്ങളുടെ ഘടകങ്ങൾ വിന്യസിച്ചിരിക്കുന്നിടത്തെല്ലാം, നിങ്ങളുടെ നെറ്റ്‌വർക്ക് കാര്യക്ഷമമായി പ്രവർത്തിപ്പിക്കുന്നതിന് നിങ്ങളുടെ മാനേജ്മെൻറ് സിസ്റ്റത്തിൽ (കുബേർനെറ്റ്സ് പോലുള്ളവ) ഉയർന്ന വൈദഗ്ദ്ധ്യം ആവശ്യമാണ്. അതുപോലെ, നെറ്റ്വർക്കിന്റെ ഘടന ബിസിനസ്സ് ഉപയോഗ കേസും നെറ്റ്വർക്ക് പ്രവർത്തിക്കാൻ രൂപകൽപ്പന ചെയ്തിട്ടുള്ള വ്യവസായത്തിന്റെ പ്രസക്തമായ ഏതെങ്കിലും നിയമങ്ങളും നിയന്ത്രണ സർക്കാരും യോജിക്കുന്ന തരത്തിൽ രൂപകൽപ്പന ചെയ്തിരിക്കണം.

source: This deployment guide will not go through every iteration and potential network configuration, but does give common guidelines and rules to consider.
ml: ഈ വിന്യാസ ഗൈഡ് എല്ലാ ആവർത്തനത്തിലൂടെയും സാധ്യതയുള്ള നെറ്റ്‌വർക്ക് കോൺഫിഗറേഷനിലൂടെയും കടന്നുപോകില്ല, പക്ഷേ പരിഗണിക്കാൻ പൊതുവായ മാർഗ്ഗനിർദ്ദേശങ്ങളും നിയമങ്ങളും നൽകുന്നു.

source: Step two: Set up a cluster for your resources
ml: ഘട്ടം രണ്ട്: നിങ്ങളുടെ റിസോഴ്സ്സ് വേണ്ടി ഒരു ക്ലസ്റ്റർ സജ്ജമാക്കുക

source: Generally speaking, Fabric is agnostic to the method used to deploy and manage it. It is possible, for example, to deploy and manage a peer from a laptop. For a number of reasons, this is likely to be unadvisable, but there is nothing in Fabric that prohibits it.
ml: പൊതുവായി പറഞ്ഞാൽ, ഫാബ്രിക് വിന്യസിക്കാനും കൈകാര്യം ചെയ്യാനും ഉപയോഗിക്കുന്ന രീതിക്ക് അജ്ഞ്ഞേയവാദിയാണ്. ഉദാഹരണത്തിന്, ഒരു ലാപ്‌ടോപ്പിൽ നിന്ന് ഒരു പിയറെ വിന്യസിക്കാനും നിയന്ത്രിക്കാനും കഴിയും. നിരവധി കാരണങ്ങളാൽ, ഇത് ശുപാർശ ചെയ്യാൻ സാധ്യതയില്ല, പക്ഷേ ഇത് നിരോധിക്കുന്ന ഒന്നും ഫാബ്രിക്കിൽ ഇല്ല.

source: As long as you have the ability to deploy containers, whether locally (or behind a firewall), or in a cloud, it should be possible to stand up components and connect them to each other. However, Kubernetes features a number of helpful tools that have made it a popular container management platform for deploying and managing Fabric networks. For more information about Kubernetes, check out `the Kubernetes documentation <https://kubernetes.io/docs>`_. This topic will mostly limit its scope to the binaries and provide instructions that can be applied when using a Docker deployment or Kubernetes.
ml: പ്രാദേശികമായി (അല്ലെങ്കിൽ ഒരു ഫയർവാളിന് പിന്നിൽ) അല്ലെങ്കിൽ ഒരു ക്ലൗഡിലായാലും കണ്ടെയ്‌നറുകൾ വിന്യസിക്കാനുള്ള കഴിവ് നിങ്ങൾക്ക് ഉള്ളിടത്തോളം കാലം, ഘടകങ്ങൾ ഉയർത്തിപ്പിടിച്ച് അവയെ പരസ്പരം ബന്ധിപ്പിക്കാൻ കഴിയും. എന്നിരുന്നാലും, ഫാബ്രിക് നെറ്റ്‌വർക്കുകൾ വിന്യസിക്കുന്നതിനും കൈകാര്യം ചെയ്യുന്നതിനുമുള്ള ഒരു ജനപ്രിയ കണ്ടെയ്നർ മാനേജുമെന്റ് പ്ലാറ്റ്‌ഫോമായി മാറ്റിയ നിരവധി സഹായകരമായ ഉപകരണങ്ങൾ കുബേർനെറ്റ്സ് അവതരിപ്പിക്കുന്നു. കുബേർനെറ്റസിനെക്കുറിച്ചുള്ള കൂടുതൽ വിവരങ്ങൾക്ക്, പരിശോധിക്കുക `കുബേർനെറ്റ്സ് ഡോക്യുമെന്റേഷൻ <https://kubernetes.io/docs>`_. ഈ വിഷയം മിക്കവാറും അതിന്റെ വ്യാപ്തി ബൈനറികളിലേക്ക് പരിമിതപ്പെടുത്തുകയും ഡോക്കർ വിന്യാസം അല്ലെങ്കിൽ കുബേർനെറ്റ്സ് ഉപയോഗിക്കുമ്പോൾ പ്രയോഗിക്കാൻ കഴിയുന്ന നിർദ്ദേശങ്ങൾ നൽകുകയും ചെയ്യും.

source: However and wherever you choose to deploy your components, you will need to make sure you have enough resources for the components to run effectively. The sizes you need will largely depend on your use case. If you plan to join a single peer to several high volume channels, it will need much more CPU and memory than a peer a user plans to join to a single channel. As a rough estimate, plan to dedicate approximately three times the resources to a peer as you plan to allocate to a single ordering node (as you will see below, it is recommended to deploy at least three and optimally five nodes in an ordering service). Similarly, you should need approximately a tenth of the resources for a CA as you will for a peer. You will also need to add storage to your cluster (some cloud providers may provide storage) as you cannot configure Persistent Volumes and Persistent Volume Claims without storage being set up with your cloud provider first.
ml: എന്നിരുന്നാലും, നിങ്ങളുടെ ഘടകങ്ങൾ വിന്യസിക്കാൻ നിങ്ങൾ തിരഞ്ഞെടുക്കുന്നിടത്തെല്ലാം, ഘടകങ്ങൾ ഫലപ്രദമായി പ്രവർത്തിക്കാൻ ആവശ്യമായ ഉറവിടങ്ങൾ നിങ്ങൾക്കുണ്ടെന്ന് ഉറപ്പാക്കേണ്ടതുണ്ട്. നിങ്ങൾക്ക് ആവശ്യമുള്ള വലുപ്പങ്ങൾ പ്രധാനമായും നിങ്ങളുടെ ഉപയോഗ കേസിനെ ആശ്രയിച്ചിരിക്കും. നിരവധി ഉയർന്ന ചാനലുകളിലേക്ക് ഒരൊറ്റ പിയറിൽ ചേരാൻ നിങ്ങൾ ആഗ്രഹിക്കുന്നുവെങ്കിൽ, ഒരു ഉപയോക്താവ് ഒരൊറ്റ ചാനലിൽ ചേരാൻ ഉദ്ദേശിക്കുന്ന ഒരു പിയറിനേക്കാൾ കൂടുതൽ സിപിയുവും മെമ്മറിയും ഇതിന് ആവശ്യമാണ്. ഒരു ഏകദേശ കണക്കനുസരിച്ച്, ഒരൊറ്റ ഓർഡറിംഗ് നോഡിലേക്ക് നീക്കിവയ്ക്കാൻ നിങ്ങൾ പദ്ധതിയിടുമ്പോൾ ഏകദേശം മൂന്നിരട്ടി വിഭവങ്ങൾ ഒരു പിയറിനായി സമർപ്പിക്കാൻ പദ്ധതിയിടുക (നിങ്ങൾ ചുവടെ കാണുന്നത് പോലെ, ഒരു ഓർഡറിംഗ് സേവനത്തിൽ കുറഞ്ഞത് മൂന്ന്, ഒപ്റ്റിമൽ അഞ്ച് നോഡുകളെങ്കിലും വിന്യസിക്കാൻ ശുപാർശ ചെയ്യുന്നു) . അതുപോലെ, ഒരു സി‌എയ്‌ക്കായി നിങ്ങൾക്ക് ഏകദേശം പത്തിലൊന്ന് വിഭവങ്ങൾ ആവശ്യമാണ്. നിങ്ങളുടെ ക്ലൗഡിലേക്ക് ആദ്യം സ്റ്റോറേജ് സജ്ജീകരിക്കാതെ തന്നെ സ്ഥിരമായ വോള്യങ്ങളും പെർസിസ്റ്റന്റ് വോളിയം ക്ലെയിമുകളും കോൺഫിഗർ ചെയ്യാൻ കഴിയാത്തതിനാൽ നിങ്ങളുടെ ക്ലസ്റ്ററിലേക്ക് സ്റ്റോറേജ് ചേർക്കേണ്ടതുണ്ട് (ചില ക്ലൗഡ് ദാതാക്കൾ സംഭരണം നൽകിയേക്കാം).

source: By deploying a proof of concept network and testing it under load, you will have a better sense of the resources you will require.
ml: കൺസെപ്റ്റ് നെറ്റ്‌വർക്കിന്റെ ഒരു തെളിവ് വിന്യസിച്ച് അത് ലോഡിന് കീഴിൽ പരീക്ഷിക്കുന്നതിലൂടെ, നിങ്ങൾക്ക് ആവശ്യമായ വിഭവങ്ങളെക്കുറിച്ച് നിങ്ങൾക്ക് മികച്ച ധാരണ ലഭിക്കും.

source: Managing your infrastructure
ml: നിങ്ങളുടെ ഇൻഫ്രാസ്ട്രക്ചർ മാനേജുചെയ്യുന്നു

source: The exact methods and tools you use to manage your backend will depend on the backend you choose. However, here are some considerations worth noting.
ml: നിങ്ങളുടെ ബാക്കെൻഡ് നിയന്ത്രിക്കാൻ നിങ്ങൾ ഉപയോഗിക്കുന്ന കൃത്യമായ രീതികളും ഉപകരണങ്ങളും നിങ്ങൾ തിരഞ്ഞെടുക്കുന്ന ബാക്കെൻഡിനെ ആശ്രയിച്ചിരിക്കും. എന്നിരുന്നാലും, ശ്രദ്ധിക്കേണ്ട ചില പരിഗണനകൾ ഇതാ.

source: Using secret objects to securely store important configuration files in your cluster. For information about Kubernetes secrets, check out `Kubernetes secrets <https://kubernetes.io/docs/concepts/configuration/secret/>`_. You also have the option to use Hardened Security Modules (HSMs) or encrypted Persistent Volumes (PVs). Along similar lines, after deploying Fabric components, you will likely want to connect to a container on your own backend, for example using a private repo in a service like Docker Hub. In that case, you will need to code the login information in the form of a Kubernetes secret and include it in the YAML file when deploying components.
ml: നിങ്ങളുടെ ക്ലസ്റ്ററിൽ പ്രധാനപ്പെട്ട കോൺഫിഗറേഷൻ ഫയലുകൾ സുരക്ഷിതമായി സംഭരിക്കുന്നതിന് രഹസ്യ വസ്‌തുക്കൾ ഉപയോഗിക്കുന്നു. കുബേർനെറ്റ്സ് രഹസ്യങ്ങളെക്കുറിച്ചുള്ള കൂടുതൽ വിവരങ്ങൾക്ക്, പരിശോധിക്കുക `കുബേർനെറ്റ്സ് രഹസ്യങ്ങൾ <https://kubernetes.io/docs/concepts/configuration/secret/>`_.കഠിനമാക്കിയ സുരക്ഷാ മൊഡ്യൂളുകൾ (എച്ച്എസ്എം) അല്ലെങ്കിൽ എൻക്രിപ്റ്റുചെയ്‌ത പെർസിസ്റ്റന്റ് വോള്യങ്ങൾ (പിവി) ഉപയോഗിക്കാനും നിങ്ങൾക്ക് ഓപ്ഷനുണ്ട്. സമാനമായ രീതിയിൽ, ഫാബ്രിക് ഘടകങ്ങൾ വിന്യസിച്ചതിന് ശേഷം, നിങ്ങളുടെ സ്വന്തം ബാക്കെൻഡിലെ ഒരു കണ്ടെയ്നറിലേക്ക് കണക്റ്റുചെയ്യാൻ നിങ്ങൾ ആഗ്രഹിച്ചേക്കാം, ഉദാഹരണത്തിന് ഡോക്കർ ഹബ് പോലുള്ള സേവനത്തിൽ ഒരു സ്വകാര്യ റിപ്പോ ഉപയോഗിക്കുന്നു. അത്തരം സന്ദർഭങ്ങളിൽ, നിങ്ങൾ ലോഗിൻ വിവരങ്ങൾ ഒരു കുബേർനെറ്റ്സ് രഹസ്യത്തിന്റെ രൂപത്തിൽ കോഡ് ചെയ്യുകയും ഘടകങ്ങൾ വിന്യസിക്കുമ്പോൾ അത് YAML ഫയലിൽ ഉൾപ്പെടുത്തുകയും വേണം.

source: Cluster considerations and node sizing. In step 2 above, we discussed a general outline for how to think about the sizings of nodes. Your use case, as well as a robust period of development, is the only way you will truly know how how large your peers, ordering nodes, and CAs will need to be.
ml: ക്ലസ്റ്റർ പരിഗണനകളും നോഡ് വലുപ്പവും. മുകളിലുള്ള ഘട്ടം 2 ൽ, നോഡുകളുടെ വലുപ്പത്തെക്കുറിച്ച് എങ്ങനെ ചിന്തിക്കാമെന്നതിനുള്ള ഒരു പൊതു രൂപരേഖ ഞങ്ങൾ ചർച്ചചെയ്തു. നിങ്ങളുടെ സമപ്രായക്കാർ, ഓർ‌ഡറിംഗ് നോഡുകൾ‌, സി‌എകൾ‌ എന്നിവ എത്ര വലുതായിരിക്കണമെന്ന് നിങ്ങൾ‌ക്കറിയാവുന്ന ഒരേയൊരു മാർ‌ഗ്ഗം നിങ്ങളുടെ ഉപയോഗ കേസും, വികസനത്തിന്റെ ശക്തമായ കാലഘട്ടവുമാണ്.

source: How you choose to mount your volumes. It is a best practice to mount the volumes relevant to your nodes external to the place where your nodes are deployed. This will allow you to reference these volumes later on (for example, restarting a node or a container that has crashed) without having to redeploy or regenerate your crypto material.
ml: നിങ്ങളുടെ വോള്യങ്ങൾ മൌണ്ട് ചെയ്യാൻ നിങ്ങൾ എങ്ങനെ തിരഞ്ഞെടുക്കുന്നു. നിങ്ങളുടെ നോഡുകൾക്ക് വിന്യസിച്ചിരിക്കുന്ന സ്ഥലത്തേക്ക് ബാഹ്യമായി നിങ്ങളുടെ നോഡുകൾക്ക് പ്രസക്തമായ വോള്യങ്ങൾ മൌണ്ട് ചെയ്യുന്നത് ഒരു മികച്ച പരിശീലനമാണ്. നിങ്ങളുടെ ക്രിപ്റ്റോ മെറ്റീരിയൽ വീണ്ടും വിന്യസിക്കുകയോ പുനരുജ്ജീവിപ്പിക്കുകയോ ചെയ്യാതെ ഈ വോള്യങ്ങൾ പിന്നീട് പരാമർശിക്കാൻ ഇത് നിങ്ങളെ അനുവദിക്കും (ഉദാഹരണത്തിന്, ഒരു നോഡ് അല്ലെങ്കിൽ തകർന്ന കണ്ടെയ്നർ പുനരാരംഭിക്കുന്നു).

source: How you will monitor your resources. It is critical that you establish a strategy and method for monitoring the resources used by your individual nodes and the resources deployed to your cluster generally. As you join your peers to more channels, you will need likely need to increase its CPU and memory allocation. Similarly, you will need to make sure you have enough storage space for your state database and blockchain.
ml: നിങ്ങളുടെ ഉറവിടങ്ങൾ എങ്ങനെ നിരീക്ഷിക്കും. നിങ്ങളുടെ വ്യക്തിഗത നോഡുകൾ ഉപയോഗിക്കുന്ന ഉറവിടങ്ങളും നിങ്ങളുടെ ക്ലസ്റ്ററിലേക്ക് സാധാരണയായി വിന്യസിച്ചിരിക്കുന്ന ഉറവിടങ്ങളും നിരീക്ഷിക്കുന്നതിനുള്ള ഒരു തന്ത്രവും രീതിയും നിങ്ങൾ സ്ഥാപിക്കുന്നത് നിർണായകമാണ്. നിങ്ങളുടെ സഹപാഠികളുമായി കൂടുതൽ ചാനലുകളിലേക്ക് ചേരുമ്പോൾ, നിങ്ങൾക്ക് അതിന്റെ സിപിയുവും മെമ്മറി അലോക്കേഷനും വർദ്ധിപ്പിക്കേണ്ടതുണ്ട്. അതുപോലെ, നിങ്ങളുടെ സ്റ്റേറ്റ് ഡാറ്റാബേസിനും ബ്ലോക്ക്ചെയിനിനുമായി മതിയായ സംഭരണ ഇടം ഉണ്ടെന്ന് ഉറപ്പാക്കേണ്ടതുണ്ട്.

source: Step three: Set up your CAs
ml: ഘട്ടം മൂന്ന്: നിങ്ങളുടെ സി‌എകൾ സജ്ജമാക്കുക

source: The first component that must be deployed in a Fabric network is a CA. This is because the certificates associated with a node (not just for the node itself but also the certificates identifying who can administer the node) must be created before the node itself can be deployed. While it is not necessary to use the Fabric CA to create these certificates, the Fabric CA also creates MSP structures that are needed for components and organizations to be properly defined. If a user chooses to use a CA other than the Fabric CA, they will have to create the MSP folders themselves.
ml: ഒരു ഫാബ്രിക് നെറ്റ്‌വർക്കിൽ വിന്യസിക്കേണ്ട ആദ്യത്തെ ഘടകം ഒരു സിഎ ആണ്. കാരണം, നോഡുമായി ബന്ധപ്പെട്ട സർട്ടിഫിക്കറ്റുകൾ (നോഡിന് മാത്രമല്ല, നോഡ് ആര് നിയന്ത്രിക്കാമെന്ന് തിരിച്ചറിയുന്ന സർട്ടിഫിക്കറ്റുകളും) നോഡ് വിന്യസിക്കുന്നതിന് മുമ്പ് സൃഷ്ടിക്കേണ്ടതുണ്ട്. ഈ സർ‌ട്ടിഫിക്കറ്റുകൾ‌ സൃഷ്‌ടിക്കുന്നതിന് ഫാബ്രിക് സി‌എ ഉപയോഗിക്കേണ്ടതില്ലെങ്കിലും, ഘടകങ്ങൾക്കും ഓർ‌ഗനൈസേഷനുകൾ‌ക്കും ശരിയായി നിർ‌വ്വചിക്കുന്നതിന് ആവശ്യമായ എം‌എസ്‌പി ഘടനകളും ഫാബ്രിക് സി‌എ സൃഷ്ടിക്കുന്നു. ഫാബ്രിക് സി‌എ ഒഴികെയുള്ള ഒരു സി‌എ ഉപയോഗിക്കാൻ ഒരു ഉപയോക്താവ് തിരഞ്ഞെടുക്കുകയാണെങ്കിൽ, അവർ സ്വയം എം‌എസ്‌പി ഫോൾഡറുകൾ സൃഷ്ടിക്കേണ്ടതുണ്ട്.

source: One CA (or more, if you are using intermediate CAs --- more on intermediate CAs below) is used to generate (through a process called "enrollment") the certificates of the admin of an organization, the MSP of that organization, and any nodes owned by that organization. This CA will also generate the certificates for any additional users. Because of its role in "enrolling" identities, this CA is sometimes called the "enrollment CA" or the "ecert CA".
ml: ഒരു സി‌എ (അല്ലെങ്കിൽ‌ കൂടുതൽ‌, നിങ്ങൾ‌ ഇന്റർ‌മീഡിയറ്റ് സി‌എകൾ‌ ഉപയോഗിക്കുകയാണെങ്കിൽ‌ --- ചുവടെയുള്ള ഇന്റർ‌മീഡിയറ്റ് സി‌എകളിൽ‌ കൂടുതൽ‌) ഒരു ഓർ‌ഗനൈസേഷൻറെ അഡ്‌മിൻറെ സർ‌ട്ടിഫിക്കറ്റുകൾ‌ ജനറേറ്റ് ചെയ്യുന്നതിന് ("എൻ‌റോൾ‌മെന്റ് " എന്ന് വിളിക്കുന്ന ഒരു പ്രക്രിയയിലൂടെ) ആ ഓർ‌ഗനൈസേഷൻറെ എം‌എസ്‌പി , ആ ഓർഗനൈസേഷന്റെ ഉടമസ്ഥതയിലുള്ള ഏതെങ്കിലും നോഡുകൾ. ഏതെങ്കിലും അധിക ഉപയോക്താക്കൾ‌ക്കായി ഈ സി‌എ സർ‌ട്ടിഫിക്കറ്റുകൾ‌ ജനറേറ്റുചെയ്യും. "എൻറോൾ " ഐഡന്റിറ്റികളിലെ പങ്ക് കാരണം, ഈ സി‌എയെ ചിലപ്പോൾ "എൻറോൾമെന്റ് സി‌എ " അല്ലെങ്കിൽ "എകേർട്ട് സി‌എ " എന്ന് വിളിക്കുന്നു.
